[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:58:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester Email must be a valid email."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:58:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
+              {true &&
                 "Requester Email must be a valid email."}
             </Form.Control.Feedback>
killedBy: HelpRequestForm tests renders correctly
statusReason: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="requesterEmail"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:129:28
               data-testid="HelpRequestForm-solved"
               id="solved"
               type="switch"
-              {...register("solved")}
+              {...register("")}
             />
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')
