[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.jsx:60:19
     {
       header: "Solved?",
       id: "solved",
-      accessorFn: (row) => String(row.solved),
+      accessorFn: () => undefined,
     },
   ];
killedBy: HelpRequestTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
