[Killed] BooleanLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:7:70
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function HelpRequestCreatePage({ setupInitialTarget = false }) {
+export default function HelpRequestCreatePage({ setupInitialTarget = true }) {
   const objectToAxiosParams = (helpRequest) => ({
     url: "/api/helprequests/post",
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/helprequest' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ setupInitialTarget = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      requestTime: helpRequest.requestTime,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.jsx:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ setupInitialTarget = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      requestTime: helpRequest.requestTime,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestCreatePage.jsx:40:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !setupInitialTarget) {
+  if (false) {
     return <Navigate to="/helprequest" />;
   }
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/helprequest' } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestCreatePage.jsx:40:7
     mutation.mutate(data);
   };
 
-  if (isSuccess && !setupInitialTarget) {
+  if (true) {
     return <Navigate to="/helprequest" />;
   }
killedBy: HelpRequestCreatePage tests renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
