[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/helprequests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, hard to test for survivor
-      method: "GET",
-      url: `/api/helprequests`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-requesterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestEditPage.jsx:28:34
     },
   );
 
-  const objectToAxiosPutParams = (helpRequest) => ({
-    url: "/api/helprequests",
-    method: "PUT",
-    params: {
-      id: helpRequest.id,
-    },
-    data: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      explanation: helpRequest.explanation,
-      requestTime: helpRequest.requestTime,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "HelpRequest Updated - id: 17 explanation: Docker issues",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `HelpRequest Updated - id: ${helpRequest.id} explanation: ${helpRequest.explanation}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
