[NoCoverage] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/RecommendationRequests/create">Create</a>
-        </p>
-        <p>
-          <a href="/RecommendationRequests/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RecommendationRequestIndexPage() {}
 
