[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.jsx:67:7
     },
   ];
 
-  if (currentUser && hasRole(currentUser, "ROLE_ADMIN")) {
+  if (currentUser || hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
       ButtonColumn(
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"
  type="button"
>
  Edit

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:67:58
     },
   ];
 
-  if (currentUser && hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  if (currentUser && hasRole(currentUser, "ROLE_ADMIN")) {}
   /*
   return (
killedBy: RecommendationRequestTable tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestTable.jsx:97:13
 
   return (
     <OurTable
-      data={recommendationRequests ?? []}
+      data={recommendationRequests && []}
       columns={columns}
       testid={"RecommendationRequestTable"}
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="RecommendationRequestTable"
