[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:131:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "Date is required. "}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticleForm.jsx:131:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.dateAdded && "Date is required. "}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: ArticleForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
