[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuitemreview) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: menuitemreview.itemId,
-      reviewerEmail: menuitemreview.reviewerEmail,
-      stars: menuitemreview.stars,
-      dateReviewed: menuitemreview.dateReviewed,
-      comments: menuitemreview.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (menuitemreview) => {
-    toast(`New Menu Item Review Created - id: ${menuitemreview.id}`);
-  };
+  const onSuccess = (menuitemreview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:21:11
   });
 
   const onSuccess = (menuitemreview) => {
-    toast(`New Menu Item Review Created - id: ${menuitemreview.id}`);
+    toast(``);
   };
 
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New Menu Item Review Created - id: 3",
