[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.jsx:23:23
   // Similar to UCSBDateForm; accepts values like 2024-05-15T13:30
   // Stryker disable Regex
   // Stryker restore Regex
-  const email_regex = /^\S+@\S+\.\S+$/;
+  const email_regex = /^\S+@\S+\.\s+$/;
 
   return (
killedBy: MenuItemReview tests No Error messsages on good input
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.jsx:23:23
   // Similar to UCSBDateForm; accepts values like 2024-05-15T13:30
   // Stryker disable Regex
   // Stryker restore Regex
-  const email_regex = /^\S+@\S+\.\S+$/;
+  const email_regex = /^\S+@\S+\.\S+/;
 
   return (
killedBy: MenuItemReview tests Correct Error message when email has extra text after valid email
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={"MenuItemReviewForm-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid={"MenuItemReviewForm-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: MenuItemReview tests renders correctly
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:28:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid={"MenuItemReviewForm-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: MenuItemReview tests renders correctly when passing in a MenuItemReview
statusReason: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:52:38
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "Item Id is required.",
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Item Id is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:78:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerEmail && "Reviewer Email is required. "}
+              {true}
               {errors.reviewerEmail?.type === "pattern" &&
                 "Reviewer Email must be a valid email."}
killedBy: MenuItemReview tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.jsx:79:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer Email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
+              {errors.reviewerEmail.type === "pattern" &&
                 "Reviewer Email must be a valid email."}
             </Form.Control.Feedback>
killedBy: MenuItemReview tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:79:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.reviewerEmail && "Reviewer Email is required. "}
-              {errors.reviewerEmail?.type === "pattern" &&
+              {errors.reviewerEmail?.type !== "pattern" &&
                 "Reviewer Email must be a valid email."}
             </Form.Control.Feedback>
killedBy: MenuItemReview tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
