[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/menuitemreviews/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: MenuItemReviewTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/menuitemreviews/edit/2' ]

Received: 

  1st vi.fn() call:

  [
-   "/menuitemreviews/edit/2",
